#############################################################
#                       Brewfile                            #
#############################################################

tap 'homebrew/cask-fonts'

#------------------------
# Development Essentials
#------------------------

brew 'git'                    # Git for version control
brew 'neovim'                 # Extensible text editor
brew 'vim'                    # Vim text editor
brew 'tmux'                   # Terminal multiplexer

#------------------------
# Development Utilities
#------------------------

brew 'awscli'                 # AWS CLI
brew 'gh'                     # GitHub CLI
brew 'ghq'                    # Remote repo management
brew 'node'                   # Node.js runtime
brew 'yarn'                   # Package manager for Node.js
brew 'anyenv'                 # All in for ** env
brew 'mysql-client'           # MySQL client
brew 'mysql'                  # MySQL
brew 'redis'                  # redis

#------------------------
# Shell and CLI Tools
#------------------------

brew 'fish'                   # User-friendly shell
brew 'fzf'                    # Fuzzy finder
brew 'htop'                   # Process viewer
brew 'jq'                     # JSON processor
brew 'ripgrep'                # Fast search tool
brew 'ag'                     # Fast search tool
brew 'tig'                    # Text interface for Git
brew 'tree'                   # Directory tree viewer
brew 'pipx'                   # Python Cli Installer
brew 'openssl'                # SSL/TLS toolkit
brew 'wget'                   # File downloader

#------------------------
# GUI Applications
#------------------------

cask 'alfred'                 # App launcher
cask 'google-chrome'          # Web browser
cask 'iterm2'                 # Terminal emulator
cask 'karabiner-elements'     # Keyboard customizer
cask 'visual-studio-code'     # Code editor
cask 'google-japanese-ime'    # Japanese IME
cask 'docker'                 # Docker Desktop
cask 'sequel-ace'             # Graphical MySQL Client
cask 'clipy'                  # Clipboard Utilities

#------------------------
# fonts
#------------------------

cask 'font-inconsolata-for-powerline'

#------------------------
# VSCode Extensions
#------------------------

# Formatting and Linting
vscode "dbaeumer.vscode-eslint"
vscode "esbenp.prettier-vscode"
vscode "ms-python.black-formatter"
vscode "ms-python.flake8"
vscode "misogi.ruby-rubocop"

# GitHub Tools
vscode "GitHub.copilot"
vscode "GitHub.copilot-chat"
vscode "GitHub.copilot-labs"
vscode "github.vscode-github-actions"
vscode "GitHub.vscode-pull-request-github"

# Language Support
vscode "golang.go"
vscode "haskell.haskell"
vscode "redhat.java"
vscode "ms-python.python"
vscode "Shopify.ruby-lsp"
vscode "Vue.volar"

# Remote Work and Containers
vscode "ms-azuretools.vscode-docker"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"

# Miscellaneous
vscode "jebbs.plantuml"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "vscodevim.vim"
