tap "homebrew/cask"
tap "github/gh"

cask_args appdir: "~/Applications"

brew "awscli"
brew "fish"
brew "fzf"
brew "ag"
brew "jq"
brew "wget"
brew "python3"
brew "vim"
brew "neovim"
brew "tig"
brew "tmux"
brew "htop"
brew "github/gh/gh"



cask "google-chrome"

cask "google-japanese-ime"

cask "iterm2"
cask 'alfred'
cask 'virtualbox'
cask 'vagrant'
cask 'virtualbox-extension-pack'
cask 'docker'
cask 'visual-studio-code'
cask "karabiner-elements"
cask "sequel-pro"


cask "slack"
